#+TITLE: setup_unix_home
#+DATE: <2016-06-09 Thu>
#+AUTHOR: Rajdeep
#+EMAIL: rajdeep.mondal@amd.com
#+LANGUAGE: en
#+CREATOR: Emacs 25.0.94.2 (Org mode 8.3.4)
#+STARTUP: inlineimages

:PROPERTIES: 
:var: user=ramondal
:var: host=ltipc979
:session: mysession
:tangle:  yes
:END: 

** update spacemacs
#+BEGIN_SRC sh :dir ~/.emacs.d
git pull --rebase
#+END_SRC

#+RESULTS:
: Current branch master is up to date.

** check the modline
#+BEGIN_SRC sh :results output :dir ~/
cvt 3820 1025 60
#+END_SRC

#+RESULTS:
: # 3824x1025 59.94 Hz (CVT) hsync: 63.77 kHz; pclk: 325.50 MHz
: Modeline "3824x1025_60.00"  325.50  3824 4064 4464 5104  1025 1028 1038 1064 -hsync +vsync

** clone it to some temp dir
#+BEGIN_SRC sh :results output :dir ~/
git clone -v https://github.com/git/git.git /tmp/temp_git
#+END_SRC

#+RESULTS:
: Exit 1

** get the completion script
#+BEGIN_SRC sh :results output :dir /tmp/temp_git
cp -vf contrib/completion/* ~/scripts/downloaded/.
#+END_SRC

#+RESULTS:
: Exit 1
: `contrib/completion/git-completion.bash' -> `/home/ramondal/scripts/downloaded/./git-completion.bash'
: `contrib/completion/git-completion.tcsh' -> `/home/ramondal/scripts/downloaded/./git-completion.tcsh'
: `contrib/completion/git-completion.zsh' -> `/home/ramondal/scripts/downloaded/./git-completion.zsh'
: `contrib/completion/git-prompt.sh' -> `/home/ramondal/scripts/downloaded/./git-prompt.sh'

** get p4-diff into the path
#+BEGIN_SRC sh :results output :dir /tmp/temp_p4_diff
chmod u+x p4-diff
cp -vf p4-diff ~/scripts/downloaded
#+END_SRC

#+RESULTS:
: 'p4-diff' -> '/home/ramondal/scripts/downloaded/p4-diff'

** remove the git directory
#+BEGIN_SRC sh :results output :dir ~/
rm -rvf /tmp/temp_p4_diff
#+END_SRC

#+RESULTS:
#+begin_example
removed '/tmp/temp_p4_diff/README.md'
removed '/tmp/temp_p4_diff/.git/logs/HEAD'
removed '/tmp/temp_p4_diff/.git/logs/refs/heads/master'
removed directory '/tmp/temp_p4_diff/.git/logs/refs/heads'
removed '/tmp/temp_p4_diff/.git/logs/refs/remotes/origin/HEAD'
removed directory '/tmp/temp_p4_diff/.git/logs/refs/remotes/origin'
removed directory '/tmp/temp_p4_diff/.git/logs/refs/remotes'
removed directory '/tmp/temp_p4_diff/.git/logs/refs'
removed directory '/tmp/temp_p4_diff/.git/logs'
removed '/tmp/temp_p4_diff/.git/info/exclude'
removed directory '/tmp/temp_p4_diff/.git/info'
removed '/tmp/temp_p4_diff/.git/objects/83/a2056cd643a81ee0c619c59ce53d1ac2ca475a'
removed directory '/tmp/temp_p4_diff/.git/objects/83'
removed '/tmp/temp_p4_diff/.git/objects/78/a4b80c448f290034e757f04ffebce86c7a136c'
removed directory '/tmp/temp_p4_diff/.git/objects/78'
removed '/tmp/temp_p4_diff/.git/objects/ec/dd6107ff9883c00cc585496f3fd05f47179995'
removed directory '/tmp/temp_p4_diff/.git/objects/ec'
removed '/tmp/temp_p4_diff/.git/objects/39/91b2494fbe582fc9921f7ebac1ab68ec5d1f5e'
removed directory '/tmp/temp_p4_diff/.git/objects/39'
removed directory '/tmp/temp_p4_diff/.git/objects/info'
removed '/tmp/temp_p4_diff/.git/objects/8c/cf0f4a29ab3be66c5a05fcd23c262c073f09d6'
removed directory '/tmp/temp_p4_diff/.git/objects/8c'
removed '/tmp/temp_p4_diff/.git/objects/27/22793bc6ce2fefad7b682e1d9cbac6f18f0190'
removed directory '/tmp/temp_p4_diff/.git/objects/27'
removed '/tmp/temp_p4_diff/.git/objects/bf/1c67e9939c26e9b0ff3984aae72f9b934f092c'
removed directory '/tmp/temp_p4_diff/.git/objects/bf'
removed '/tmp/temp_p4_diff/.git/objects/f6/18efc03b5b3f6f41c46340e0de9bae914d74dc'
removed directory '/tmp/temp_p4_diff/.git/objects/f6'
removed '/tmp/temp_p4_diff/.git/objects/b2/0b48f1699a1a0fc9cefdf767e3d9fb78b7cebf'
removed '/tmp/temp_p4_diff/.git/objects/b2/c14a2efa24329a967998472f5f3e9309bdd5be'
removed directory '/tmp/temp_p4_diff/.git/objects/b2'
removed '/tmp/temp_p4_diff/.git/objects/47/2e310fbd24401142a29282019859670ae50cf3'
removed directory '/tmp/temp_p4_diff/.git/objects/47'
removed '/tmp/temp_p4_diff/.git/objects/8d/d098ce2d86d0a3f6a0aa79984c50ab1c57d9d1'
removed directory '/tmp/temp_p4_diff/.git/objects/8d'
removed '/tmp/temp_p4_diff/.git/objects/25/2a63ba05c3a19d9201e274f891fda14e8c8965'
removed directory '/tmp/temp_p4_diff/.git/objects/25'
removed '/tmp/temp_p4_diff/.git/objects/1d/4642db1f12fb3fe88212d36d6af3277b7ebb46'
removed directory '/tmp/temp_p4_diff/.git/objects/1d'
removed '/tmp/temp_p4_diff/.git/objects/b1/d1150b064630b94e28452709395229594407a5'
removed directory '/tmp/temp_p4_diff/.git/objects/b1'
removed '/tmp/temp_p4_diff/.git/objects/7e/ec9bb563ee728d29702b9a367a35c7acdaab5f'
removed directory '/tmp/temp_p4_diff/.git/objects/7e'
removed '/tmp/temp_p4_diff/.git/objects/49/ab7f268cc4b51bc0e433f8bf47fb5ff04eeb40'
removed '/tmp/temp_p4_diff/.git/objects/49/2f020b22c1b457c0f1db3fc3753b90cb46fc11'
removed directory '/tmp/temp_p4_diff/.git/objects/49'
removed '/tmp/temp_p4_diff/.git/objects/91/01dfa2b2c91a0ef7b9b5085a52282f5074efc8'
removed '/tmp/temp_p4_diff/.git/objects/91/b154b0f8a8127688777eeed616b3838b6863a0'
removed directory '/tmp/temp_p4_diff/.git/objects/91'
removed '/tmp/temp_p4_diff/.git/objects/37/f78f2c7c489e962d8b039ab629c866be8537fb'
removed directory '/tmp/temp_p4_diff/.git/objects/37'
removed '/tmp/temp_p4_diff/.git/objects/0a/ac8e644150767a9d84612f1b242a7f812a7eea'
removed directory '/tmp/temp_p4_diff/.git/objects/0a'
removed '/tmp/temp_p4_diff/.git/objects/b6/eed3aa4c6698f6b14a7cabb1119a9591559fb0'
removed directory '/tmp/temp_p4_diff/.git/objects/b6'
removed '/tmp/temp_p4_diff/.git/objects/a6/fc187c4a81a1a782f8712b291e618a2a638355'
removed directory '/tmp/temp_p4_diff/.git/objects/a6'
removed '/tmp/temp_p4_diff/.git/objects/6e/8e22661ad04a9abcd6b1afacc94e6db937e98b'
removed directory '/tmp/temp_p4_diff/.git/objects/6e'
removed directory '/tmp/temp_p4_diff/.git/objects/pack'
removed '/tmp/temp_p4_diff/.git/objects/7d/55c27c0796d3884d51f9d3a91855080e78ca38'
removed directory '/tmp/temp_p4_diff/.git/objects/7d'
removed '/tmp/temp_p4_diff/.git/objects/46/ecc32cfc50e6fad86b4240f8b5124192cdf840'
removed directory '/tmp/temp_p4_diff/.git/objects/46'
removed '/tmp/temp_p4_diff/.git/objects/22/05ba2c12ccb96eaff4757e5ff0abfd83b492e3'
removed directory '/tmp/temp_p4_diff/.git/objects/22'
removed directory '/tmp/temp_p4_diff/.git/objects'
removed '/tmp/temp_p4_diff/.git/index'
removed '/tmp/temp_p4_diff/.git/config'
removed '/tmp/temp_p4_diff/.git/description'
removed '/tmp/temp_p4_diff/.git/HEAD'
removed '/tmp/temp_p4_diff/.git/hooks/post-update.sample'
removed '/tmp/temp_p4_diff/.git/hooks/pre-receive.sample'
removed '/tmp/temp_p4_diff/.git/hooks/update.sample'
removed '/tmp/temp_p4_diff/.git/hooks/applypatch-msg.sample'
removed '/tmp/temp_p4_diff/.git/hooks/prepare-commit-msg.sample'
removed '/tmp/temp_p4_diff/.git/hooks/commit-msg.sample'
removed '/tmp/temp_p4_diff/.git/hooks/pre-push.sample'
removed '/tmp/temp_p4_diff/.git/hooks/pre-applypatch.sample'
removed '/tmp/temp_p4_diff/.git/hooks/fsmonitor-watchman.sample'
removed '/tmp/temp_p4_diff/.git/hooks/pre-commit.sample'
removed '/tmp/temp_p4_diff/.git/hooks/pre-rebase.sample'
removed directory '/tmp/temp_p4_diff/.git/hooks'
removed directory '/tmp/temp_p4_diff/.git/branches'
removed directory '/tmp/temp_p4_diff/.git/refs/tags'
removed '/tmp/temp_p4_diff/.git/refs/heads/master'
removed directory '/tmp/temp_p4_diff/.git/refs/heads'
removed '/tmp/temp_p4_diff/.git/refs/remotes/origin/HEAD'
removed directory '/tmp/temp_p4_diff/.git/refs/remotes/origin'
removed directory '/tmp/temp_p4_diff/.git/refs/remotes'
removed directory '/tmp/temp_p4_diff/.git/refs'
removed '/tmp/temp_p4_diff/.git/packed-refs'
removed directory '/tmp/temp_p4_diff/.git'
removed '/tmp/temp_p4_diff/p4-diff'
removed directory '/tmp/temp_p4_diff'
#+end_example

** get vimer into the path
#+BEGIN_SRC sh :results output :dir /tmp/temp_vimer
chmod u+x vimer
cp -vf vimer ~/scripts/downloaded
#+END_SRC

#+RESULTS:
: 'vimer' -> '/home/ramondal/scripts/downloaded/vimer'

** remove the git directory
#+BEGIN_SRC sh :results output :dir ~/
rm -rvf /tmp/temp_vimer
#+END_SRC

#+RESULTS:
#+begin_example
removed '/tmp/temp_vimer/dev/README.md'
removed directory: '/tmp/temp_vimer/dev'
removed '/tmp/temp_vimer/.git/index'
removed '/tmp/temp_vimer/.git/packed-refs'
removed '/tmp/temp_vimer/.git/hooks/prepare-commit-msg.sample'
removed '/tmp/temp_vimer/.git/hooks/pre-applypatch.sample'
removed '/tmp/temp_vimer/.git/hooks/update.sample'
removed '/tmp/temp_vimer/.git/hooks/pre-commit.sample'
removed '/tmp/temp_vimer/.git/hooks/commit-msg.sample'
removed '/tmp/temp_vimer/.git/hooks/applypatch-msg.sample'
removed '/tmp/temp_vimer/.git/hooks/pre-push.sample'
removed '/tmp/temp_vimer/.git/hooks/pre-rebase.sample'
removed '/tmp/temp_vimer/.git/hooks/post-update.sample'
removed directory: '/tmp/temp_vimer/.git/hooks'
removed directory: '/tmp/temp_vimer/.git/branches'
removed '/tmp/temp_vimer/.git/HEAD'
removed '/tmp/temp_vimer/.git/objects/12/9bb020b19fe52acf3a6734dbc03fed716d1d79'
removed directory: '/tmp/temp_vimer/.git/objects/12'
removed '/tmp/temp_vimer/.git/objects/78/157628483bb66747e2780058bea7cee3b34d4c'
removed directory: '/tmp/temp_vimer/.git/objects/78'
removed '/tmp/temp_vimer/.git/objects/53/04b9900ec561fd5335a0195f7066412165d996'
removed directory: '/tmp/temp_vimer/.git/objects/53'
removed '/tmp/temp_vimer/.git/objects/31/18df58d98396e2516a43e51fc08382a48bc97f'
removed directory: '/tmp/temp_vimer/.git/objects/31'
removed '/tmp/temp_vimer/.git/objects/54/bd6031dba8725fee7986efa5b9320f17972ca2'
removed '/tmp/temp_vimer/.git/objects/54/1157cf64e4e7bf88476d28fad4d8dbca1efeab'
removed directory: '/tmp/temp_vimer/.git/objects/54'
removed '/tmp/temp_vimer/.git/objects/8f/16a23a345249d2505a58852d75be95b3afa132'
removed directory: '/tmp/temp_vimer/.git/objects/8f'
removed '/tmp/temp_vimer/.git/objects/1c/b975de29d211cdac09cb622b7a431054081e8a'
removed directory: '/tmp/temp_vimer/.git/objects/1c'
removed directory: '/tmp/temp_vimer/.git/objects/pack'
removed '/tmp/temp_vimer/.git/objects/35/f9d19505ec82e052d7c5b04ba8bdc1be8d8813'
removed directory: '/tmp/temp_vimer/.git/objects/35'
removed '/tmp/temp_vimer/.git/objects/27/67def31da4cdda8005b7bcbe7bf15ed288d30d'
removed '/tmp/temp_vimer/.git/objects/27/66aedc04ed1666e1ba762d77079e86051d0adb'
removed directory: '/tmp/temp_vimer/.git/objects/27'
removed '/tmp/temp_vimer/.git/objects/0b/20b40e142e95e1e0bd497acd4b35a332df80de'
removed directory: '/tmp/temp_vimer/.git/objects/0b'
removed '/tmp/temp_vimer/.git/objects/5e/75e4d83d3ad5a80d9b1826898023dfdb0fb883'
removed directory: '/tmp/temp_vimer/.git/objects/5e'
removed '/tmp/temp_vimer/.git/objects/dd/c0fd1065aeb3ab3bb115b44a5f5821fb4dd385'
removed directory: '/tmp/temp_vimer/.git/objects/dd'
removed '/tmp/temp_vimer/.git/objects/47/dae336620e0ea994fcd881ea153349bed0aa88'
removed directory: '/tmp/temp_vimer/.git/objects/47'
removed '/tmp/temp_vimer/.git/objects/9a/990c9ac25147e5b0a3c540eccbbb5fed030efb'
removed directory: '/tmp/temp_vimer/.git/objects/9a'
removed '/tmp/temp_vimer/.git/objects/8c/845abe8f2eab9b1904c1f02adcb900328768d4'
removed directory: '/tmp/temp_vimer/.git/objects/8c'
removed '/tmp/temp_vimer/.git/objects/aa/ae809949a39e6cfc42e441d3b021c129235412'
removed '/tmp/temp_vimer/.git/objects/aa/7c713076dc990cf6f91b5fd1b4cd092109350d'
removed directory: '/tmp/temp_vimer/.git/objects/aa'
removed '/tmp/temp_vimer/.git/objects/8a/b8c546a83857e5eb997272c288780008de8ab7'
removed directory: '/tmp/temp_vimer/.git/objects/8a'
removed '/tmp/temp_vimer/.git/objects/48/6e2b71910c137f24abda027e8c63d6ad784a9b'
removed directory: '/tmp/temp_vimer/.git/objects/48'
removed '/tmp/temp_vimer/.git/objects/ad/9682908f97f06278a0344749828a9d6b3659e1'
removed directory: '/tmp/temp_vimer/.git/objects/ad'
removed '/tmp/temp_vimer/.git/objects/c3/1b4cbc10974eda3a2a0f0fc75b82c432be0a77'
removed directory: '/tmp/temp_vimer/.git/objects/c3'
removed '/tmp/temp_vimer/.git/objects/d6/b387598b9e3fbaf420011b3a6f97693b7d29d6'
removed directory: '/tmp/temp_vimer/.git/objects/d6'
removed '/tmp/temp_vimer/.git/objects/f3/881bd3898c740fdfcf16656089b64d0924023c'
removed directory: '/tmp/temp_vimer/.git/objects/f3'
removed '/tmp/temp_vimer/.git/objects/03/7a5f19a29cb81e78d6cebce06ca7897a098f7a'
removed directory: '/tmp/temp_vimer/.git/objects/03'
removed '/tmp/temp_vimer/.git/objects/d3/7b3977e06c149f59162e56e9bfdb8a625f20fa'
removed directory: '/tmp/temp_vimer/.git/objects/d3'
removed '/tmp/temp_vimer/.git/objects/e6/76feacf5a75ee76b7f7eadc9064dc0ac64d9df'
removed '/tmp/temp_vimer/.git/objects/e6/1a3140735a4449f08ec621d33770ee97891028'
removed directory: '/tmp/temp_vimer/.git/objects/e6'
removed '/tmp/temp_vimer/.git/objects/d2/03e1be5ff4635ff55002504a0b84b224b7863c'
removed directory: '/tmp/temp_vimer/.git/objects/d2'
removed '/tmp/temp_vimer/.git/objects/4c/4c8f0b5fa973576ead3afda1afa30cd21c311c'
removed directory: '/tmp/temp_vimer/.git/objects/4c'
removed '/tmp/temp_vimer/.git/objects/38/53f13fbac11c987c80d0cb4e3a0256833a162c'
removed directory: '/tmp/temp_vimer/.git/objects/38'
removed '/tmp/temp_vimer/.git/objects/2b/1eef6c49bd0af8984d57c834c209a92da0b5e4'
removed directory: '/tmp/temp_vimer/.git/objects/2b'
removed '/tmp/temp_vimer/.git/objects/7b/827268f123f40f5bb4b14ca96d93a5142c73cf'
removed '/tmp/temp_vimer/.git/objects/7b/b62ff4cd0b2c2da65e8641898da57cc7d4f4b2'
removed directory: '/tmp/temp_vimer/.git/objects/7b'
removed '/tmp/temp_vimer/.git/objects/eb/a02149ce26923445a8a6a8ff620c6a870179f5'
removed directory: '/tmp/temp_vimer/.git/objects/eb'
removed '/tmp/temp_vimer/.git/objects/b0/0f07a6499df033b92d868c06ea43b216f95397'
removed directory: '/tmp/temp_vimer/.git/objects/b0'
removed '/tmp/temp_vimer/.git/objects/b1/7f159b3f3791d39f54593e2c5dbb1a642334bb'
removed directory: '/tmp/temp_vimer/.git/objects/b1'
removed '/tmp/temp_vimer/.git/objects/00/9b281132ae5820598c43e9f6592fb041883c4b'
removed directory: '/tmp/temp_vimer/.git/objects/00'
removed '/tmp/temp_vimer/.git/objects/b9/f27378ef1243ac11608fb29db4923efdf080f5'
removed '/tmp/temp_vimer/.git/objects/b9/c0cffa152d94c5244b5e717983975d8766b78e'
removed directory: '/tmp/temp_vimer/.git/objects/b9'
removed '/tmp/temp_vimer/.git/objects/24/aa0f0b918215a5204587810f5ed1c1b3b5a460'
removed directory: '/tmp/temp_vimer/.git/objects/24'
removed '/tmp/temp_vimer/.git/objects/e8/172eaccd5c8f436f868890a923edcfeec80549'
removed '/tmp/temp_vimer/.git/objects/e8/b232565ff2bfab2a1b709e613f1d1b05490cd6'
removed directory: '/tmp/temp_vimer/.git/objects/e8'
removed '/tmp/temp_vimer/.git/objects/4e/d89e06d15a42195c54cf192531ea567e446b0d'
removed directory: '/tmp/temp_vimer/.git/objects/4e'
removed '/tmp/temp_vimer/.git/objects/3c/7cb69c90003cb86d09b6901149098ffac5a833'
removed directory: '/tmp/temp_vimer/.git/objects/3c'
removed '/tmp/temp_vimer/.git/objects/9f/3f43ac875a8f5cafcf3db0c274567072a19248'
removed directory: '/tmp/temp_vimer/.git/objects/9f'
removed '/tmp/temp_vimer/.git/objects/6f/8da9d6da51bd8386debeb98058e64dc74e487f'
removed directory: '/tmp/temp_vimer/.git/objects/6f'
removed '/tmp/temp_vimer/.git/objects/d1/a6d2fecaa5117cc0dcc78fe8142bab272d3160'
removed directory: '/tmp/temp_vimer/.git/objects/d1'
removed '/tmp/temp_vimer/.git/objects/76/e8af2a2e8fdc8f570bb0d70d099fb55b082cfa'
removed directory: '/tmp/temp_vimer/.git/objects/76'
removed '/tmp/temp_vimer/.git/objects/d9/980322416e08a09af575f97f0b96eef2fb0b91'
removed directory: '/tmp/temp_vimer/.git/objects/d9'
removed '/tmp/temp_vimer/.git/objects/af/2ee3a96a4154c836f8a5828e1e2dc5fd3627f4'
removed directory: '/tmp/temp_vimer/.git/objects/af'
removed '/tmp/temp_vimer/.git/objects/c7/0e404c96379235571d18b5c010a7539e8e7e27'
removed '/tmp/temp_vimer/.git/objects/c7/d0c70fe065c23548ee11141fcf5773ce50fff8'
removed directory: '/tmp/temp_vimer/.git/objects/c7'
removed '/tmp/temp_vimer/.git/objects/ca/508fde516f19d5c84302441afbfcf53b47e10e'
removed directory: '/tmp/temp_vimer/.git/objects/ca'
removed '/tmp/temp_vimer/.git/objects/44/c6bdea3740428896bfd5975c10947a0bc76915'
removed directory: '/tmp/temp_vimer/.git/objects/44'
removed '/tmp/temp_vimer/.git/objects/7c/a525aefd5348e06378b5bff1c784e18a382671'
removed directory: '/tmp/temp_vimer/.git/objects/7c'
removed '/tmp/temp_vimer/.git/objects/be/0d8cdcd5b0e03241bebc9f98ae4e77e3b6a3e1'
removed directory: '/tmp/temp_vimer/.git/objects/be'
removed '/tmp/temp_vimer/.git/objects/21/5c2358d7ac0f5db6468178bf52ff367cb0e81c'
removed directory: '/tmp/temp_vimer/.git/objects/21'
removed '/tmp/temp_vimer/.git/objects/b5/fc7d8dfdfc67eb477da61a7c3d02cd974ae21b'
removed directory: '/tmp/temp_vimer/.git/objects/b5'
removed '/tmp/temp_vimer/.git/objects/c0/59bcddbdfc7cffc17be37b8d0ae3d09a38ac3b'
removed directory: '/tmp/temp_vimer/.git/objects/c0'
removed '/tmp/temp_vimer/.git/objects/98/4cf72ed615b407a248423272afd760542f0aa9'
removed directory: '/tmp/temp_vimer/.git/objects/98'
removed '/tmp/temp_vimer/.git/objects/c9/d2dc5e6c7b89f5eaba17998337457e6a85b59b'
removed directory: '/tmp/temp_vimer/.git/objects/c9'
removed '/tmp/temp_vimer/.git/objects/79/35f647b42bdb044ac0fcb2c0e87fa64082f0ee'
removed directory: '/tmp/temp_vimer/.git/objects/79'
removed '/tmp/temp_vimer/.git/objects/0c/bb8e70c82873eee8c493d76419f36cf319e288'
removed directory: '/tmp/temp_vimer/.git/objects/0c'
removed '/tmp/temp_vimer/.git/objects/7f/2b9695b11b4a8a2e57f0e9c7c52a98e0d07777'
removed directory: '/tmp/temp_vimer/.git/objects/7f'
removed '/tmp/temp_vimer/.git/objects/ee/cc8f0c6b282b15dde47fa6c0d23ff4bc6b7701'
removed directory: '/tmp/temp_vimer/.git/objects/ee'
removed '/tmp/temp_vimer/.git/objects/f4/e3ad7c944788d26fa8ce3853c702b99c7f224f'
removed directory: '/tmp/temp_vimer/.git/objects/f4'
removed directory: '/tmp/temp_vimer/.git/objects/info'
removed '/tmp/temp_vimer/.git/objects/18/786cd9a1c8c4a19eb4a33d6582957fa92065b9'
removed directory: '/tmp/temp_vimer/.git/objects/18'
removed '/tmp/temp_vimer/.git/objects/f1/21cc41b844c03767c6e7d4ce89be4374d9f7ee'
removed directory: '/tmp/temp_vimer/.git/objects/f1'
removed '/tmp/temp_vimer/.git/objects/64/1f31178e0760f4f79f808135c6ba6a89f10a86'
removed '/tmp/temp_vimer/.git/objects/64/24d4b8cc1eb18ccacf8ce28978d8421ad70ed3'
removed directory: '/tmp/temp_vimer/.git/objects/64'
removed '/tmp/temp_vimer/.git/objects/69/08ce44c700b2235d972ee35af21bff86555afc'
removed directory: '/tmp/temp_vimer/.git/objects/69'
removed '/tmp/temp_vimer/.git/objects/6c/957ad8779da24199a534632511d7c1f0813364'
removed directory: '/tmp/temp_vimer/.git/objects/6c'
removed '/tmp/temp_vimer/.git/objects/f5/8a21ba54568e0771855266e849a16c21287adb'
removed directory: '/tmp/temp_vimer/.git/objects/f5'
removed '/tmp/temp_vimer/.git/objects/ed/33951d681bad85f990492351f4ba8b9d6617f3'
removed directory: '/tmp/temp_vimer/.git/objects/ed'
removed '/tmp/temp_vimer/.git/objects/a3/ccb5ff1dd61815fb28e5d0c6efd7c813ce360d'
removed directory: '/tmp/temp_vimer/.git/objects/a3'
removed '/tmp/temp_vimer/.git/objects/f9/7e20b0fb27ff662c0830a0b787afd795c6b6ef'
removed directory: '/tmp/temp_vimer/.git/objects/f9'
removed directory: '/tmp/temp_vimer/.git/objects'
removed '/tmp/temp_vimer/.git/refs/remotes/origin/HEAD'
removed directory: '/tmp/temp_vimer/.git/refs/remotes/origin'
removed directory: '/tmp/temp_vimer/.git/refs/remotes'
removed directory: '/tmp/temp_vimer/.git/refs/tags'
removed '/tmp/temp_vimer/.git/refs/heads/master'
removed directory: '/tmp/temp_vimer/.git/refs/heads'
removed directory: '/tmp/temp_vimer/.git/refs'
removed '/tmp/temp_vimer/.git/logs/HEAD'
removed '/tmp/temp_vimer/.git/logs/refs/remotes/origin/HEAD'
removed directory: '/tmp/temp_vimer/.git/logs/refs/remotes/origin'
removed directory: '/tmp/temp_vimer/.git/logs/refs/remotes'
removed '/tmp/temp_vimer/.git/logs/refs/heads/master'
removed directory: '/tmp/temp_vimer/.git/logs/refs/heads'
removed directory: '/tmp/temp_vimer/.git/logs/refs'
removed directory: '/tmp/temp_vimer/.git/logs'
removed '/tmp/temp_vimer/.git/config'
removed '/tmp/temp_vimer/.git/description'
removed '/tmp/temp_vimer/.git/info/exclude'
removed directory: '/tmp/temp_vimer/.git/info'
removed directory: '/tmp/temp_vimer/.git'
removed '/tmp/temp_vimer/CHANGES.md'
removed '/tmp/temp_vimer/LICENSE.md'
removed '/tmp/temp_vimer/vimer'
removed '/tmp/temp_vimer/test/setup'
removed '/tmp/temp_vimer/test/test_vimer'
removed '/tmp/temp_vimer/test/mockvim'
removed '/tmp/temp_vimer/test/test'
removed '/tmp/temp_vimer/test/mockcat'
removed directory: '/tmp/temp_vimer/test'
removed '/tmp/temp_vimer/README.md'
removed '/tmp/temp_vimer/.travis.yml'
removed '/tmp/temp_vimer/.gitignore'
removed '/tmp/temp_vimer/vimer.cmd'
removed '/tmp/temp_vimer/Makefile'
removed directory: '/tmp/temp_vimer'
#+end_example

** get only the executables
#+NAME: executables
#+BEGIN_SRC sh :results scalar :dir /tmp/more_utils
find . -executable -type f
#+END_SRC

#+RESULTS: executables
#+begin_example
./check-isutf8
./lckdo
./ifne
./vidir
./ifdata
./debian/rules
./pee
./chronic
./mispipe
./vipe
./.git/hooks/commit-msg.sample
./.git/hooks/pre-push.sample
./.git/hooks/update.sample
./.git/hooks/post-update.sample
./.git/hooks/applypatch-msg.sample
./.git/hooks/pre-commit.sample
./.git/hooks/pre-applypatch.sample
./.git/hooks/pre-rebase.sample
./.git/hooks/prepare-commit-msg.sample
./isutf8
./ts
./zrun
./parallel
./combine
./sponge
#+end_example

#+RESULTS:
#+begin_example
./check-isutf8
./lckdo
./ifne
./vidir
./ifdata
./debian/rules
./pee
./chronic
./mispipe
./vipe
./.git/hooks/commit-msg.sample
./.git/hooks/pre-push.sample
./.git/hooks/update.sample
./.git/hooks/post-update.sample
./.git/hooks/applypatch-msg.sample
./.git/hooks/pre-commit.sample
./.git/hooks/pre-applypatch.sample
./.git/hooks/pre-rebase.sample
./.git/hooks/prepare-commit-msg.sample
./isutf8
./ts
./zrun
./parallel
./combine
./sponge
#+end_example

** Copy the executables
#+BEGIN_SRC sh :dir /tmp/more_utils :var EXECUTE=executables
cp -vf $EXECUTE /home/ramondal/scripts/bin/.
#+END_SRC

#+RESULTS:
| `./check-isutf8'                         | -> | `/home/ramondal/scripts/bin/./check-isutf8'              |
| `./lckdo'                                | -> | `/home/ramondal/scripts/bin/./lckdo'                     |
| `./ifne'                                 | -> | `/home/ramondal/scripts/bin/./ifne'                      |
| `./vidir'                                | -> | `/home/ramondal/scripts/bin/./vidir'                     |
| `./ifdata'                               | -> | `/home/ramondal/scripts/bin/./ifdata'                    |
| `./debian/rules'                         | -> | `/home/ramondal/scripts/bin/./rules'                     |
| `./pee'                                  | -> | `/home/ramondal/scripts/bin/./pee'                       |
| `./chronic'                              | -> | `/home/ramondal/scripts/bin/./chronic'                   |
| `./mispipe'                              | -> | `/home/ramondal/scripts/bin/./mispipe'                   |
| `./vipe'                                 | -> | `/home/ramondal/scripts/bin/./vipe'                      |
| `./.git/hooks/commit-msg.sample'         | -> | `/home/ramondal/scripts/bin/./commit-msg.sample'         |
| `./.git/hooks/pre-push.sample'           | -> | `/home/ramondal/scripts/bin/./pre-push.sample'           |
| `./.git/hooks/update.sample'             | -> | `/home/ramondal/scripts/bin/./update.sample'             |
| `./.git/hooks/post-update.sample'        | -> | `/home/ramondal/scripts/bin/./post-update.sample'        |
| `./.git/hooks/applypatch-msg.sample'     | -> | `/home/ramondal/scripts/bin/./applypatch-msg.sample'     |
| `./.git/hooks/pre-commit.sample'         | -> | `/home/ramondal/scripts/bin/./pre-commit.sample'         |
| `./.git/hooks/pre-applypatch.sample'     | -> | `/home/ramondal/scripts/bin/./pre-applypatch.sample'     |
| `./.git/hooks/pre-rebase.sample'         | -> | `/home/ramondal/scripts/bin/./pre-rebase.sample'         |
| `./.git/hooks/prepare-commit-msg.sample' | -> | `/home/ramondal/scripts/bin/./prepare-commit-msg.sample' |
| `./isutf8'                               | -> | `/home/ramondal/scripts/bin/./isutf8'                    |
| `./ts'                                   | -> | `/home/ramondal/scripts/bin/./ts'                        |
| `./zrun'                                 | -> | `/home/ramondal/scripts/bin/./zrun'                      |
| `./parallel'                             | -> | `/home/ramondal/scripts/bin/./parallel'                  |
| `./combine'                              | -> | `/home/ramondal/scripts/bin/./combine'                   |
| `./sponge'                               | -> | `/home/ramondal/scripts/bin/./sponge'                    |


** remove the clone directory
#+BEGIN_SRC sh :results output :dir ~/
rm -rvf /tmp/more_utils
#+END_SRC

#+RESULTS:
#+begin_example
removed `/tmp/more_utils/check-isutf8'
removed `/tmp/more_utils/lckdo.docbook'
removed `/tmp/more_utils/lckdo'
removed `/tmp/more_utils/sponge.c'
removed `/tmp/more_utils/ifne.c'
removed `/tmp/more_utils/ifne'
removed `/tmp/more_utils/vidir'
removed `/tmp/more_utils/parallel.c'
removed `/tmp/more_utils/ifdata.docbook'
removed `/tmp/more_utils/.gitattributes'
removed `/tmp/more_utils/ifdata'
removed `/tmp/more_utils/debian/changelog'
removed `/tmp/more_utils/debian/docs'
removed `/tmp/more_utils/debian/compat'
removed `/tmp/more_utils/debian/rules'
removed `/tmp/more_utils/debian/control'
removed `/tmp/more_utils/debian/copyright'
removed directory: `/tmp/more_utils/debian'
removed `/tmp/more_utils/mispipe.docbook'
removed `/tmp/more_utils/isutf8.c'
removed `/tmp/more_utils/pee'
removed `/tmp/more_utils/chronic'
removed `/tmp/more_utils/physmem.c'
removed `/tmp/more_utils/mispipe'
removed `/tmp/more_utils/vipe'
removed `/tmp/more_utils/.git/info/exclude'
removed directory: `/tmp/more_utils/.git/info'
removed `/tmp/more_utils/.git/hooks/commit-msg.sample'
removed `/tmp/more_utils/.git/hooks/pre-push.sample'
removed `/tmp/more_utils/.git/hooks/update.sample'
removed `/tmp/more_utils/.git/hooks/post-update.sample'
removed `/tmp/more_utils/.git/hooks/applypatch-msg.sample'
removed `/tmp/more_utils/.git/hooks/pre-commit.sample'
removed `/tmp/more_utils/.git/hooks/pre-applypatch.sample'
removed `/tmp/more_utils/.git/hooks/pre-rebase.sample'
removed `/tmp/more_utils/.git/hooks/prepare-commit-msg.sample'
removed directory: `/tmp/more_utils/.git/hooks'
removed `/tmp/more_utils/.git/HEAD'
removed `/tmp/more_utils/.git/objects/pack/pack-04ad3db4fe2058dad56519f7c508911b35b29c63.idx'
removed `/tmp/more_utils/.git/objects/pack/pack-04ad3db4fe2058dad56519f7c508911b35b29c63.pack'
removed directory: `/tmp/more_utils/.git/objects/pack'
removed directory: `/tmp/more_utils/.git/objects/info'
removed directory: `/tmp/more_utils/.git/objects'
removed directory: `/tmp/more_utils/.git/branches'
removed `/tmp/more_utils/.git/index'
removed `/tmp/more_utils/.git/refs/remotes/origin/HEAD'
removed directory: `/tmp/more_utils/.git/refs/remotes/origin'
removed directory: `/tmp/more_utils/.git/refs/remotes'
removed `/tmp/more_utils/.git/refs/heads/master'
removed directory: `/tmp/more_utils/.git/refs/heads'
removed directory: `/tmp/more_utils/.git/refs/tags'
removed directory: `/tmp/more_utils/.git/refs'
removed `/tmp/more_utils/.git/config'
removed `/tmp/more_utils/.git/packed-refs'
removed `/tmp/more_utils/.git/description'
removed `/tmp/more_utils/.git/logs/HEAD'
removed `/tmp/more_utils/.git/logs/refs/remotes/origin/HEAD'
removed directory: `/tmp/more_utils/.git/logs/refs/remotes/origin'
removed directory: `/tmp/more_utils/.git/logs/refs/remotes'
removed `/tmp/more_utils/.git/logs/refs/heads/master'
removed directory: `/tmp/more_utils/.git/logs/refs/heads'
removed directory: `/tmp/more_utils/.git/logs/refs'
removed directory: `/tmp/more_utils/.git/logs'
removed directory: `/tmp/more_utils/.git'
removed `/tmp/more_utils/isutf8.docbook'
removed `/tmp/more_utils/sponge.docbook'
removed `/tmp/more_utils/pee.c'
removed `/tmp/more_utils/README'
removed `/tmp/more_utils/Makefile'
removed `/tmp/more_utils/mispipe.c'
removed `/tmp/more_utils/lckdo.c'
removed `/tmp/more_utils/ifdata.c'
removed `/tmp/more_utils/isutf8'
removed `/tmp/more_utils/COPYING'
removed `/tmp/more_utils/ts'
removed `/tmp/more_utils/zrun'
removed `/tmp/more_utils/pee.docbook'
removed `/tmp/more_utils/parallel'
removed `/tmp/more_utils/combine'
removed `/tmp/more_utils/sponge'
removed `/tmp/more_utils/ifne.docbook'
removed `/tmp/more_utils/parallel.docbook'
removed directory: `/tmp/more_utils'
#+end_example

** do a make and install
#+BEGIN_SRC sh :results output :dir /tmp/temp_fzy
make PREFIX=/home/ramondal/scripts && make PREFIX=/home/ramondal/scripts install
#+END_SRC

#+RESULTS:
#+begin_example
cp src/config.def.h config.h
cc -DVERSION=\"0.8\" -D_GNU_SOURCE -Wall -Wextra -g -std=c99 -O3 -pedantic -c -o src/fzy.o src/fzy.c
cc -DVERSION=\"0.8\" -D_GNU_SOURCE -Wall -Wextra -g -std=c99 -O3 -pedantic -c -o src/match.o src/match.c
cc -DVERSION=\"0.8\" -D_GNU_SOURCE -Wall -Wextra -g -std=c99 -O3 -pedantic -c -o src/tty.o src/tty.c
cc -DVERSION=\"0.8\" -D_GNU_SOURCE -Wall -Wextra -g -std=c99 -O3 -pedantic -c -o src/choices.o src/choices.c
cc -DVERSION=\"0.8\" -D_GNU_SOURCE -Wall -Wextra -g -std=c99 -O3 -pedantic -c -o src/options.o src/options.c
cc -DVERSION=\"0.8\" -D_GNU_SOURCE -Wall -Wextra -g -std=c99 -O3 -pedantic -c -o src/tty_interface.o src/tty_interface.c
cc -Wall -Wextra -g -std=c99 -O3 -pedantic  -o fzy src/fzy.o src/match.o src/tty.o src/choices.o src/options.o src/tty_interface.o -lpthread
mkdir -p /home/ramondal/scripts/bin
cp fzy /home/ramondal/scripts/bin/
chmod 755 /home/ramondal/scripts/bin/fzy
mkdir -p /home/ramondal/scripts/share/man/man1
cp fzy.1 /home/ramondal/scripts/share/man/man1/
chmod 644 /home/ramondal/scripts/share/man/man1/fzy.1
#+end_example

** remove the clone directory
#+BEGIN_SRC sh :results output :dir ~/
rm -rvf /tmp/temp_fzy
#+END_SRC

#+RESULTS:
#+begin_example
removed '/tmp/temp_fzy/config.h'
removed '/tmp/temp_fzy/fzy.1'
removed '/tmp/temp_fzy/.git/index'
removed '/tmp/temp_fzy/.git/packed-refs'
removed '/tmp/temp_fzy/.git/hooks/prepare-commit-msg.sample'
removed '/tmp/temp_fzy/.git/hooks/pre-applypatch.sample'
removed '/tmp/temp_fzy/.git/hooks/update.sample'
removed '/tmp/temp_fzy/.git/hooks/pre-commit.sample'
removed '/tmp/temp_fzy/.git/hooks/commit-msg.sample'
removed '/tmp/temp_fzy/.git/hooks/applypatch-msg.sample'
removed '/tmp/temp_fzy/.git/hooks/pre-push.sample'
removed '/tmp/temp_fzy/.git/hooks/pre-rebase.sample'
removed '/tmp/temp_fzy/.git/hooks/post-update.sample'
removed directory: '/tmp/temp_fzy/.git/hooks'
removed directory: '/tmp/temp_fzy/.git/branches'
removed '/tmp/temp_fzy/.git/HEAD'
removed '/tmp/temp_fzy/.git/objects/pack/pack-1d44748271321a944207384c73ba5d25b5e7f1a5.idx'
removed '/tmp/temp_fzy/.git/objects/pack/pack-1d44748271321a944207384c73ba5d25b5e7f1a5.pack'
removed directory: '/tmp/temp_fzy/.git/objects/pack'
removed directory: '/tmp/temp_fzy/.git/objects/info'
removed directory: '/tmp/temp_fzy/.git/objects'
removed '/tmp/temp_fzy/.git/refs/remotes/origin/HEAD'
removed directory: '/tmp/temp_fzy/.git/refs/remotes/origin'
removed directory: '/tmp/temp_fzy/.git/refs/remotes'
removed directory: '/tmp/temp_fzy/.git/refs/tags'
removed '/tmp/temp_fzy/.git/refs/heads/master'
removed directory: '/tmp/temp_fzy/.git/refs/heads'
removed directory: '/tmp/temp_fzy/.git/refs'
removed '/tmp/temp_fzy/.git/logs/HEAD'
removed '/tmp/temp_fzy/.git/logs/refs/remotes/origin/HEAD'
removed directory: '/tmp/temp_fzy/.git/logs/refs/remotes/origin'
removed directory: '/tmp/temp_fzy/.git/logs/refs/remotes'
removed '/tmp/temp_fzy/.git/logs/refs/heads/master'
removed directory: '/tmp/temp_fzy/.git/logs/refs/heads'
removed directory: '/tmp/temp_fzy/.git/logs/refs'
removed directory: '/tmp/temp_fzy/.git/logs'
removed '/tmp/temp_fzy/.git/config'
removed '/tmp/temp_fzy/.git/description'
removed '/tmp/temp_fzy/.git/info/exclude'
removed directory: '/tmp/temp_fzy/.git/info'
removed directory: '/tmp/temp_fzy/.git'
removed '/tmp/temp_fzy/src/choices.c'
removed '/tmp/temp_fzy/src/options.h'
removed '/tmp/temp_fzy/src/match.c'
removed '/tmp/temp_fzy/src/config.def.h'
removed '/tmp/temp_fzy/src/tty.o'
removed '/tmp/temp_fzy/src/fzy.c'
removed '/tmp/temp_fzy/src/fzy.o'
removed '/tmp/temp_fzy/src/tty_interface.h'
removed '/tmp/temp_fzy/src/tty.h'
removed '/tmp/temp_fzy/src/tty.c'
removed '/tmp/temp_fzy/src/tty_interface.c'
removed '/tmp/temp_fzy/src/choices.o'
removed '/tmp/temp_fzy/src/tty_interface.o'
removed '/tmp/temp_fzy/src/choices.h'
removed '/tmp/temp_fzy/src/match.h'
removed '/tmp/temp_fzy/src/options.c'
removed '/tmp/temp_fzy/src/match.o'
removed '/tmp/temp_fzy/src/bonus.h'
removed '/tmp/temp_fzy/src/options.o'
removed directory: '/tmp/temp_fzy/src'
removed '/tmp/temp_fzy/fzy'
removed '/tmp/temp_fzy/LICENSE'
removed '/tmp/temp_fzy/test/fzytest.c'
removed '/tmp/temp_fzy/test/acceptance/acceptance_test.rb'
removed '/tmp/temp_fzy/test/acceptance/Gemfile'
removed '/tmp/temp_fzy/test/acceptance/Gemfile.lock'
removed directory: '/tmp/temp_fzy/test/acceptance'
removed directory: '/tmp/temp_fzy/test'
removed '/tmp/temp_fzy/CHANGELOG.md'
removed '/tmp/temp_fzy/.clang-format'
removed '/tmp/temp_fzy/README.md'
removed '/tmp/temp_fzy/ALGORITHM.md'
removed '/tmp/temp_fzy/.travis.yml'
removed '/tmp/temp_fzy/.gitignore'
removed '/tmp/temp_fzy/Makefile'
removed directory: '/tmp/temp_fzy'
#+end_example

** do an install
#+BEGIN_SRC sh :results output :dir /tmp/temp_fzf
./install --all
#+END_SRC

#+RESULTS:
#+begin_example
Downloading bin/fzf ...
  - Already exists
  - Checking fzf executable ... 0.20.0

Generate /home/ramondal/.fzf.bash ... OK
Generate /home/ramondal/.fzf.zsh ... OK

Update /home/ramondal/.bashrc:
  - [ -f ~/.fzf.bash ] && source ~/.fzf.bash
    - Already exists: line #2 

Update /home/ramondal/.zshrc:
  - [ -f ~/.fzf.zsh ] && source ~/.fzf.zsh
    - Already exists: line #2 

Finished. Restart your shell or reload config file.
   source ~/.bashrc  # bash
   source ~/.zshrc   # zsh

Use uninstall script to remove fzf.

For more information, see: https://github.com/junegunn/fzf
#+end_example

** copy the man and the binary
#+BEGIN_SRC sh :results output :dir /tmp/temp_fzf :eval yes
\mkdir -p ~/scripts/share ~/scripts/bin
\cp -vfr man ~/scripts/share
\cp -vrf bin ~/scripts
#+END_SRC

#+RESULTS:
: 'man/man1/fzf-tmux.1' -> '/home/ramondal/scripts/share/man/man1/fzf-tmux.1'
: 'man/man1/fzf.1' -> '/home/ramondal/scripts/share/man/man1/fzf.1'
: 'bin/fzf' -> '/home/ramondal/scripts/bin/fzf'
: 'bin/fzf-tmux' -> '/home/ramondal/scripts/bin/fzf-tmux'

** remove the clone directory
#+BEGIN_SRC sh :results output :dir ~/
\rm -rvf /tmp/temp_fzf
#+END_SRC

#+RESULTS:
#+begin_example
removed '/tmp/temp_fzf/main.go'
removed '/tmp/temp_fzf/BUILD.md'
removed '/tmp/temp_fzf/uninstall'
removed '/tmp/temp_fzf/LICENSE'
removed '/tmp/temp_fzf/src/algo/algo_test.go'
removed '/tmp/temp_fzf/src/algo/normalize.go'
removed '/tmp/temp_fzf/src/algo/algo.go'
removed directory '/tmp/temp_fzf/src/algo'
removed '/tmp/temp_fzf/src/terminal_test.go'
removed '/tmp/temp_fzf/src/result.go'
removed '/tmp/temp_fzf/src/item_test.go'
removed '/tmp/temp_fzf/src/util/util_windows.go'
removed '/tmp/temp_fzf/src/util/util.go'
removed '/tmp/temp_fzf/src/util/util_unix.go'
removed '/tmp/temp_fzf/src/util/chars.go'
removed '/tmp/temp_fzf/src/util/atomicbool_test.go'
removed '/tmp/temp_fzf/src/util/slab.go'
removed '/tmp/temp_fzf/src/util/eventbox_test.go'
removed '/tmp/temp_fzf/src/util/eventbox.go'
removed '/tmp/temp_fzf/src/util/util_test.go'
removed '/tmp/temp_fzf/src/util/chars_test.go'
removed '/tmp/temp_fzf/src/util/atomicbool.go'
removed directory '/tmp/temp_fzf/src/util'
removed '/tmp/temp_fzf/src/LICENSE'
removed '/tmp/temp_fzf/src/protector/protector_openbsd.go'
removed '/tmp/temp_fzf/src/protector/protector.go'
removed directory '/tmp/temp_fzf/src/protector'
removed '/tmp/temp_fzf/src/update_assets.rb'
removed '/tmp/temp_fzf/src/options_test.go'
removed '/tmp/temp_fzf/src/cache.go'
removed '/tmp/temp_fzf/src/pattern_test.go'
removed '/tmp/temp_fzf/src/pattern.go'
removed '/tmp/temp_fzf/src/result_x86.go'
removed '/tmp/temp_fzf/src/result_others.go'
removed '/tmp/temp_fzf/src/reader_test.go'
removed '/tmp/temp_fzf/src/tokenizer.go'
removed '/tmp/temp_fzf/src/terminal_windows.go'
removed '/tmp/temp_fzf/src/ansi_test.go'
removed '/tmp/temp_fzf/src/history_test.go'
removed '/tmp/temp_fzf/src/reader.go'
removed '/tmp/temp_fzf/src/terminal.go'
removed '/tmp/temp_fzf/src/cache_test.go'
removed '/tmp/temp_fzf/src/chunklist_test.go'
removed '/tmp/temp_fzf/src/item.go'
removed '/tmp/temp_fzf/src/tui/ttyname_unix.go'
removed '/tmp/temp_fzf/src/tui/dummy.go'
removed '/tmp/temp_fzf/src/tui/light.go'
removed '/tmp/temp_fzf/src/tui/tui_test.go'
removed '/tmp/temp_fzf/src/tui/ttyname_windows.go'
removed '/tmp/temp_fzf/src/tui/tui.go'
removed '/tmp/temp_fzf/src/tui/tcell.go'
removed directory '/tmp/temp_fzf/src/tui'
removed '/tmp/temp_fzf/src/chunklist.go'
removed '/tmp/temp_fzf/src/matcher.go'
removed '/tmp/temp_fzf/src/result_test.go'
removed '/tmp/temp_fzf/src/constants.go'
removed '/tmp/temp_fzf/src/tokenizer_test.go'
removed '/tmp/temp_fzf/src/ansi.go'
removed '/tmp/temp_fzf/src/options.go'
removed '/tmp/temp_fzf/src/terminal_unix.go'
removed '/tmp/temp_fzf/src/core.go'
removed '/tmp/temp_fzf/src/history.go'
removed '/tmp/temp_fzf/src/merger_test.go'
removed '/tmp/temp_fzf/src/merger.go'
removed directory '/tmp/temp_fzf/src'
removed '/tmp/temp_fzf/README.md'
removed '/tmp/temp_fzf/.github/ISSUE_TEMPLATE.md'
removed directory '/tmp/temp_fzf/.github'
removed '/tmp/temp_fzf/install'
removed '/tmp/temp_fzf/doc/fzf.txt'
removed directory '/tmp/temp_fzf/doc'
removed '/tmp/temp_fzf/plugin/fzf.vim'
removed directory '/tmp/temp_fzf/plugin'
removed '/tmp/temp_fzf/go.mod'
removed '/tmp/temp_fzf/CHANGELOG.md'
removed '/tmp/temp_fzf/.git/logs/HEAD'
removed '/tmp/temp_fzf/.git/logs/refs/heads/master'
removed directory '/tmp/temp_fzf/.git/logs/refs/heads'
removed '/tmp/temp_fzf/.git/logs/refs/remotes/origin/HEAD'
removed directory '/tmp/temp_fzf/.git/logs/refs/remotes/origin'
removed directory '/tmp/temp_fzf/.git/logs/refs/remotes'
removed directory '/tmp/temp_fzf/.git/logs/refs'
removed directory '/tmp/temp_fzf/.git/logs'
removed '/tmp/temp_fzf/.git/info/exclude'
removed directory '/tmp/temp_fzf/.git/info'
removed directory '/tmp/temp_fzf/.git/objects/info'
removed '/tmp/temp_fzf/.git/objects/pack/pack-b63d893edb5af0c0168e7b7e519765456ec927b1.pack'
removed '/tmp/temp_fzf/.git/objects/pack/pack-b63d893edb5af0c0168e7b7e519765456ec927b1.idx'
removed directory '/tmp/temp_fzf/.git/objects/pack'
removed directory '/tmp/temp_fzf/.git/objects'
removed '/tmp/temp_fzf/.git/index'
removed '/tmp/temp_fzf/.git/config'
removed '/tmp/temp_fzf/.git/description'
removed '/tmp/temp_fzf/.git/HEAD'
removed '/tmp/temp_fzf/.git/hooks/post-update.sample'
removed '/tmp/temp_fzf/.git/hooks/pre-receive.sample'
removed '/tmp/temp_fzf/.git/hooks/update.sample'
removed '/tmp/temp_fzf/.git/hooks/applypatch-msg.sample'
removed '/tmp/temp_fzf/.git/hooks/prepare-commit-msg.sample'
removed '/tmp/temp_fzf/.git/hooks/commit-msg.sample'
removed '/tmp/temp_fzf/.git/hooks/pre-push.sample'
removed '/tmp/temp_fzf/.git/hooks/pre-applypatch.sample'
removed '/tmp/temp_fzf/.git/hooks/fsmonitor-watchman.sample'
removed '/tmp/temp_fzf/.git/hooks/pre-commit.sample'
removed '/tmp/temp_fzf/.git/hooks/pre-rebase.sample'
removed directory '/tmp/temp_fzf/.git/hooks'
removed directory '/tmp/temp_fzf/.git/branches'
removed directory '/tmp/temp_fzf/.git/refs/tags'
removed '/tmp/temp_fzf/.git/refs/heads/master'
removed directory '/tmp/temp_fzf/.git/refs/heads'
removed '/tmp/temp_fzf/.git/refs/remotes/origin/HEAD'
removed directory '/tmp/temp_fzf/.git/refs/remotes/origin'
removed directory '/tmp/temp_fzf/.git/refs/remotes'
removed directory '/tmp/temp_fzf/.git/refs'
removed '/tmp/temp_fzf/.git/packed-refs'
removed directory '/tmp/temp_fzf/.git'
removed '/tmp/temp_fzf/shell/completion.bash'
removed '/tmp/temp_fzf/shell/key-bindings.fish'
removed '/tmp/temp_fzf/shell/completion.zsh'
removed '/tmp/temp_fzf/shell/key-bindings.bash'
removed '/tmp/temp_fzf/shell/key-bindings.zsh'
removed directory '/tmp/temp_fzf/shell'
removed '/tmp/temp_fzf/Dockerfile'
removed '/tmp/temp_fzf/Makefile'
removed '/tmp/temp_fzf/bin/fzf-tmux'
removed '/tmp/temp_fzf/bin/fzf'
removed directory '/tmp/temp_fzf/bin'
removed '/tmp/temp_fzf/README-VIM.md'
removed '/tmp/temp_fzf/.gitignore'
removed '/tmp/temp_fzf/man/man1/fzf.1'
removed '/tmp/temp_fzf/man/man1/fzf-tmux.1'
removed directory '/tmp/temp_fzf/man/man1'
removed directory '/tmp/temp_fzf/man'
removed '/tmp/temp_fzf/.travis.yml'
removed '/tmp/temp_fzf/go.sum'
removed '/tmp/temp_fzf/test/test_go.rb'
removed '/tmp/temp_fzf/test/fzf.vader'
removed directory '/tmp/temp_fzf/test'
removed directory '/tmp/temp_fzf'
#+end_example

** extract the package
#+BEGIN_SRC sh :results value :dir ~/test
tar xvzf VNC-5.3.1-Linux-x64-RPM.tar.gz
#+END_SRC

#+RESULTS:
| VNC-Server-5.3.1-Linux-x64.rpm |
| VNC-Viewer-5.3.1-Linux-x64.rpm  |

** do a install
#+BEGIN_SRC sh :results output :dir /tmp/temp_xresources :tangle no
cp -fv  Xresources.dark ~/.Xresources
#+END_SRC

#+RESULTS:
: `Xresources.dark' -> `/home/ramondal/.Xresources'

** remove the clone directory
#+BEGIN_SRC sh :results output :dir ~/
rm -rvf /tmp/temp_xresources
#+END_SRC

#+RESULTS:
#+begin_example
removed `/tmp/temp_xresources/Xresources.light'
removed `/tmp/temp_xresources/.git/info/exclude'
removed directory: `/tmp/temp_xresources/.git/info'
removed `/tmp/temp_xresources/.git/hooks/commit-msg.sample'
removed `/tmp/temp_xresources/.git/hooks/pre-push.sample'
removed `/tmp/temp_xresources/.git/hooks/update.sample'
removed `/tmp/temp_xresources/.git/hooks/post-update.sample'
removed `/tmp/temp_xresources/.git/hooks/applypatch-msg.sample'
removed `/tmp/temp_xresources/.git/hooks/pre-commit.sample'
removed `/tmp/temp_xresources/.git/hooks/pre-applypatch.sample'
removed `/tmp/temp_xresources/.git/hooks/pre-rebase.sample'
removed `/tmp/temp_xresources/.git/hooks/prepare-commit-msg.sample'
removed directory: `/tmp/temp_xresources/.git/hooks'
removed `/tmp/temp_xresources/.git/HEAD'
removed `/tmp/temp_xresources/.git/objects/6d/b1ab8089bcda22887a41d076a235f420ad5dd4'
removed directory: `/tmp/temp_xresources/.git/objects/6d'
removed `/tmp/temp_xresources/.git/objects/4b/825dc642cb6eb9a060e54bf8d69288fbee4904'
removed directory: `/tmp/temp_xresources/.git/objects/4b'
removed `/tmp/temp_xresources/.git/objects/3b/0881aab4d5ecf303c311d4a76b0a9691b77915'
removed directory: `/tmp/temp_xresources/.git/objects/3b'
removed `/tmp/temp_xresources/.git/objects/cb/4cd757379e725d22cbff7df66dd66c3d102c4a'
removed directory: `/tmp/temp_xresources/.git/objects/cb'
removed `/tmp/temp_xresources/.git/objects/76/642b624bdc44c9e20600a9aa01342f4ff61837'
removed directory: `/tmp/temp_xresources/.git/objects/76'
removed `/tmp/temp_xresources/.git/objects/66/fcfb6061507b404e6a1205a50ef12bdd9b6942'
removed directory: `/tmp/temp_xresources/.git/objects/66'
removed `/tmp/temp_xresources/.git/objects/69/29fd2d32e0f87895ae34ddec83c947e9b51b4b'
removed directory: `/tmp/temp_xresources/.git/objects/69'
removed `/tmp/temp_xresources/.git/objects/e0/5de54f755a378034696b3440abed1a05738771'
removed directory: `/tmp/temp_xresources/.git/objects/e0'
removed `/tmp/temp_xresources/.git/objects/c2/e1f7a85fbdb40d64b4d54ad28ae38e7996e3b0'
removed directory: `/tmp/temp_xresources/.git/objects/c2'
removed `/tmp/temp_xresources/.git/objects/bc/7cc237d70f83d299d38a1f63d75da0ea3ea154'
removed directory: `/tmp/temp_xresources/.git/objects/bc'
removed `/tmp/temp_xresources/.git/objects/68/2a6d4eb19f7cae1feea8565a2aa72008cdd79a'
removed directory: `/tmp/temp_xresources/.git/objects/68'
removed `/tmp/temp_xresources/.git/objects/12/e264a58294059155a85acbcc6d13d3a78ee5dc'
removed directory: `/tmp/temp_xresources/.git/objects/12'
removed directory: `/tmp/temp_xresources/.git/objects/pack'
removed directory: `/tmp/temp_xresources/.git/objects/info'
removed `/tmp/temp_xresources/.git/objects/f1/691c2eb5f1cfe1a5b1bc23bed8c9dfe250ecf3'
removed directory: `/tmp/temp_xresources/.git/objects/f1'
removed `/tmp/temp_xresources/.git/objects/ee/08d7e44f15108ef5359550399dad55955b56ca'
removed directory: `/tmp/temp_xresources/.git/objects/ee'
removed `/tmp/temp_xresources/.git/objects/5d/1a212e2fd9cdc2b678e3be56cf776b2f16cfe2'
removed directory: `/tmp/temp_xresources/.git/objects/5d'
removed `/tmp/temp_xresources/.git/objects/ca/003f4acd4970cb334e62dc6846d1c98a6be4d1'
removed `/tmp/temp_xresources/.git/objects/ca/2ebad2addc74f6f340c9efdf9ab8250e7d91f0'
removed directory: `/tmp/temp_xresources/.git/objects/ca'
removed `/tmp/temp_xresources/.git/objects/75/f4497e5723cb6cf72875fac63dc5dbe598a3de'
removed directory: `/tmp/temp_xresources/.git/objects/75'
removed `/tmp/temp_xresources/.git/objects/26/3a23ab04168665df65bcb5d04d131475f3e2bc'
removed directory: `/tmp/temp_xresources/.git/objects/26'
removed `/tmp/temp_xresources/.git/objects/5b/2e4f8a653c6b59efae2ecc36adc5e3421ac0aa'
removed directory: `/tmp/temp_xresources/.git/objects/5b'
removed `/tmp/temp_xresources/.git/objects/49/e46c424e49404a470cf70e984b0069035aca6b'
removed directory: `/tmp/temp_xresources/.git/objects/49'
removed `/tmp/temp_xresources/.git/objects/0c/426297b558965d462f0e45f87eb16a10586c53'
removed directory: `/tmp/temp_xresources/.git/objects/0c'
removed `/tmp/temp_xresources/.git/objects/1e/a4140cca467ac6b8001a55140e0a9d3692a230'
removed directory: `/tmp/temp_xresources/.git/objects/1e'
removed `/tmp/temp_xresources/.git/objects/02/3d67adc733ace4979ff4735f7b2ca7c0aaa9f5'
removed `/tmp/temp_xresources/.git/objects/02/5ceddbddf55f2eb4ab40b05889148aab9699fc'
removed directory: `/tmp/temp_xresources/.git/objects/02'
removed `/tmp/temp_xresources/.git/objects/53/3219bad68f060111601a7f2b4bbf05dbbcc6a9'
removed directory: `/tmp/temp_xresources/.git/objects/53'
removed `/tmp/temp_xresources/.git/objects/7f/82895ee5223d93dfe15788d406d8aa891d2689'
removed directory: `/tmp/temp_xresources/.git/objects/7f'
removed `/tmp/temp_xresources/.git/objects/9f/9f133848273868b9c4c76dda8cf82c2bdd35d9'
removed directory: `/tmp/temp_xresources/.git/objects/9f'
removed `/tmp/temp_xresources/.git/objects/9d/11322c6c081f8ba4f3b441d833d5617e08d866'
removed directory: `/tmp/temp_xresources/.git/objects/9d'
removed `/tmp/temp_xresources/.git/objects/20/6be496191f52fe0e708574dd0820e97975467b'
removed directory: `/tmp/temp_xresources/.git/objects/20'
removed `/tmp/temp_xresources/.git/objects/05/9748b9ec668b757bbefd3dbc0bf25a9f348bcb'
removed directory: `/tmp/temp_xresources/.git/objects/05'
removed `/tmp/temp_xresources/.git/objects/f4/363c4c85bf21de81522d7f37a7b062329f7611'
removed `/tmp/temp_xresources/.git/objects/f4/a24b09bd61d646756b218afe4f0b3d35438eed'
removed directory: `/tmp/temp_xresources/.git/objects/f4'
removed `/tmp/temp_xresources/.git/objects/2e/512cf3c01e0f134c4ce3075e5b3e41b922dbbf'
removed directory: `/tmp/temp_xresources/.git/objects/2e'
removed `/tmp/temp_xresources/.git/objects/fa/36bb11226d4387cc907414cb24ac2ecc7b57a7'
removed directory: `/tmp/temp_xresources/.git/objects/fa'
removed `/tmp/temp_xresources/.git/objects/bf/778f2b0669e26898248802ec1c2fd511b50124'
removed directory: `/tmp/temp_xresources/.git/objects/bf'
removed `/tmp/temp_xresources/.git/objects/67/eeb935429a5cfe7ae220ce425160b6d2f81ad3'
removed directory: `/tmp/temp_xresources/.git/objects/67'
removed directory: `/tmp/temp_xresources/.git/objects'
removed directory: `/tmp/temp_xresources/.git/branches'
removed `/tmp/temp_xresources/.git/index'
removed `/tmp/temp_xresources/.git/refs/remotes/origin/HEAD'
removed directory: `/tmp/temp_xresources/.git/refs/remotes/origin'
removed directory: `/tmp/temp_xresources/.git/refs/remotes'
removed `/tmp/temp_xresources/.git/refs/heads/master'
removed directory: `/tmp/temp_xresources/.git/refs/heads'
removed directory: `/tmp/temp_xresources/.git/refs/tags'
removed directory: `/tmp/temp_xresources/.git/refs'
removed `/tmp/temp_xresources/.git/config'
removed `/tmp/temp_xresources/.git/packed-refs'
removed `/tmp/temp_xresources/.git/description'
removed `/tmp/temp_xresources/.git/logs/HEAD'
removed `/tmp/temp_xresources/.git/logs/refs/remotes/origin/HEAD'
removed directory: `/tmp/temp_xresources/.git/logs/refs/remotes/origin'
removed directory: `/tmp/temp_xresources/.git/logs/refs/remotes'
removed `/tmp/temp_xresources/.git/logs/refs/heads/master'
removed directory: `/tmp/temp_xresources/.git/logs/refs/heads'
removed directory: `/tmp/temp_xresources/.git/logs/refs'
removed directory: `/tmp/temp_xresources/.git/logs'
removed directory: `/tmp/temp_xresources/.git'
removed `/tmp/temp_xresources/LICENSE'
removed `/tmp/temp_xresources/Xresources.dark'
removed `/tmp/temp_xresources/README.md'
removed directory: `/tmp/temp_xresources'
#+end_example

